In [1]:
import requests
from sodapy import Socrata
import pandas as pd
from sqlalchemy import create_engine
#from config import password as pwr
import csv
import numpy as np

-----------------------------School Attendance DB------------------------------------------------------

must run: pip install sodapy

In [2]:
#set up Socrata client
client = Socrata("data.cityofnewyork.us", None)

#get results
results = client.get("3y5p-x48f", limit=843113)

# Convert to pandas DataFrame
results_df = pd.DataFrame.from_records(results)

#show reults
results_df

WARNING:root:Requests made without an app_token will be subject to strict throttling limits.

        school        date schoolyear enrolled present absent released
0       01M015  01/04/2016   20152016      168     157     11        0
1       01M015  01/05/2016   20152016      168     153     15        0
2       01M015  01/06/2016   20152016      168     163      5        0
3       01M015  01/07/2016   20152016      168     154     14        0
4       01M015  01/08/2016   20152016      168     158     10        0
...        ...         ...        ...      ...     ...    ...      ...
843108  79X695  11/16/2017   20172018      223     182     41        0
843109  79X695  11/17/2017   20172018      220     177     43        0
843110  79X695  11/20/2017   20172018      216     181     32        3
843111  79X695  11/21/2017   20172018      217     188     29        0
843112  79X695  11/22/2017   20172018      215     187     28        0

[843113 rows x 7 columns]

In [3]:
#delete columns
school_df=results_df[['school','date','schoolyear','enrolled','present','absent']]
school_df

        school        date schoolyear enrolled present absent
0       01M015  01/04/2016   20152016      168     157     11
1       01M015  01/05/2016   20152016      168     153     15
2       01M015  01/06/2016   20152016      168     163      5
3       01M015  01/07/2016   20152016      168     154     14
4       01M015  01/08/2016   20152016      168     158     10
...        ...         ...        ...      ...     ...    ...
843108  79X695  11/16/2017   20172018      223     182     41
843109  79X695  11/17/2017   20172018      220     177     43
843110  79X695  11/20/2017   20172018      216     181     32
843111  79X695  11/21/2017   20172018      217     188     29
843112  79X695  11/22/2017   20172018      215     187     28

[843113 rows x 6 columns]

In [4]:
#convert date to datetime
school_df['date']=pd.to_datetime(school_df['date'])

#convert to integers
school_df['enrolled']=school_df['enrolled'].astype(int)
school_df['present']=school_df['present'].astype(int)
school_df['absent']=school_df['absent'].astype(int)

#rename school to school_id which is the agreed column name that will join the group db together 
school_df.rename(columns={'school':'school_id'},inplace=True)

/opt/anaconda3/envs/PythonData/lib/python3.6/site-packages/ipykernel_launcher.py:2: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

/opt/anaconda3/envs/PythonData/lib/python3.6/site-packages/ipykernel_launcher.py:5: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  """
/opt/anaconda3/envs/PythonData/lib/python3.6/site-packages/ipykernel_launcher.py:6: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy

/opt/anaconda3/envs/PythonData/lib/python3.6/site-packages/ipykernel_launcher.py:7: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame.
Try using .loc[row_indexer,col_indexer] = value instead

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  import sys
/opt/anaconda3/envs/PythonData/lib/python3.6/site-packages/pandas/core/frame.py:4133: SettingWithCopyWarning:
A value is trying to be set on a copy of a slice from a DataFrame

See the caveats in the documentation: https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#returning-a-view-versus-a-copy
  errors=errors,

In [5]:
#verify
school_df.head()

  school_id       date schoolyear  enrolled  present  absent
0    01M015 2016-01-04   20152016       168      157      11
1    01M015 2016-01-05   20152016       168      153      15
2    01M015 2016-01-06   20152016       168      163       5
3    01M015 2016-01-07   20152016       168      154      14
4    01M015 2016-01-08   20152016       168      158      10

In [6]:
#organized by school_id to get average
school_attendance_df=school_df.groupby(['school_id']).mean()
school_attendance_df.head()

             enrolled     present     absent
school_id
01M015     176.281955  164.590226  11.546992
01M019     266.744361  242.631579  23.941729
01M020     535.383459  497.968045  37.069549
01M034     358.934211  325.776316  33.033835
01M063     202.065789  187.291353  14.503759

In [7]:
#create percentage column
school_attendance_df['attendance_prc']=round(school_attendance_df['present']/school_attendance_df['enrolled']*100,2)

In [8]:
#rename column
school_attendance_df.rename(columns={'enrolled':'enrolled_2015_2018','present':'present_2015_2018','absent':'absent_2015_2018'},inplace=True)
school_attendance_df.head()

,enrolled_2015_2018,present_2015_2018,absent_2015_2018,attendance_prc
school_id,,,,
01M015,176.281955,164.590226,11.546992,93.37
01M019,266.744361,242.631579,23.941729,90.96
01M020,535.383459,497.968045,37.069549,93.01
01M034,358.934211,325.776316,33.033835,90.76
01M063,202.065789,187.291353,14.503759,92.69

-----------------------------School Directory DB ------------------------------------------------------

In [9]:
#open school directory db
csv_file = "Resources/SchoolDirectory.csv"
directory_db = pd.read_csv(csv_file)
directory_db.head()

,dbn,school_name,borough,building_code,phone_number,fax_number,grade_span_min,grade_span_max,expgrade_span_min,expgrade_span_max,...,Council District,Census Tract,BIN,BBL,NTA,Zip Codes,Community Districts,Borough Boundaries,City Council Districts,Police Precincts
0,27Q260,Frederick Douglass Academy VI High School,Queens,Q465,718-471-2154,718-471-2890,9.0,12,NaN,NaN,...,31.0,100802.0,4300730.0,4.157360e+09,Far Rockaway-Bayswater ...,20529.0,51,3,47,59
1,21K559,Life Academy High School for Film and Music,Brooklyn,K400,718-333-7750,718-333-7775,9.0,12,NaN,NaN,...,47.0,306.0,3186454.0,3.068830e+09,Gravesend ...,17616.0,21,2,45,35
2,16K393,Frederick Douglass Academy IV Secondary School,Brooklyn,K026,718-574-2820,718-574-2821,9.0,12,NaN,NaN,...,36.0,291.0,3393805.0,3.016160e+09,Stuyvesant Heights ...,18181.0,69,2,49,52
3,08X305,Pablo Neruda Academy,Bronx,X450,718-824-1682,718-824-1663,9.0,12,NaN,NaN,...,18.0,16.0,2022205.0,2.036040e+09,Soundview-Castle Hill-Clason Point-Harding Par...,11611.0,58,5,31,26
4,03M485,Fiorello H. LaGuardia High School of Music & A...,Manhattan,M485,212-496-0700,212-724-5748,9.0,12,NaN,NaN,...,6.0,151.0,1030341.0,1.011560e+09,Lincoln Square ...,12420.0,20,4,19,12

#find column names
directory_db.columns

In [10]:
#save only needed columns
directory_db.rename(columns={'dbn': 'school_id'}, inplace = True)
directory_db = directory_db[['school_id', 'school_name', 'borough', 'total_students']].copy()
directory_db.head()

,school_id,school_name,borough,total_students
0,27Q260,Frederick Douglass Academy VI High School,Queens,412.0
1,21K559,Life Academy High School for Film and Music,Brooklyn,260.0
2,16K393,Frederick Douglass Academy IV Secondary School,Brooklyn,155.0
3,08X305,Pablo Neruda Academy,Bronx,335.0
4,03M485,Fiorello H. LaGuardia High School of Music & A...,Manhattan,2730.0

-----------------------------School Safety DB ------------------------------------------------------

In [11]:
#open school safety db
safety_csv = "Resources/SchoolSafety.csv"
safety_db = pd.read_csv(safety_csv)
safety_db.head()

,School Year,Building Code,DBN,Location Name,Location Code,Address,Borough,Geographical District Code,Register,Building Name,...,Borough Name,Postcode,Latitude,Longitude,Community Board,Council District,Census Tract,BIN,BBL,NTA
0,2015-16,K006,17K006,P.S. 006,K006,43 SNYDER AVENUE,K,17.0,712,NaN,...,BROOKLYN,11226.0,40.648590,-73.957138,14.0,40.0,794.0,3117230.0,3.051030e+09,Erasmus ...
1,2015-16,K005,16K005,P.S. 005 Dr. Ronald Mcnair,K005,820 HANCOCK STREET,K,16.0,231,NaN,...,BROOKLYN,11233.0,40.685695,-73.922463,3.0,41.0,377.0,3039906.0,3.014900e+09,Stuyvesant Heights ...
2,2015-16,K003,13K003,P.S. 003 The Bedford Village,K003,50 JEFFERSON AVENUE,K,13.0,450,NaN,...,BROOKLYN,11216.0,40.682663,-73.955338,3.0,36.0,227.0,3057406.0,3.019980e+09,Clinton Hill ...
3,2015-16,K002,NaN,655 PARKSIDE AVENUE CONSOLIDATED LOCATION,NaN,655 PARKSIDE AVENUE,K,17.0,1378,655 PARKSIDE AVENUE CONSOLIDATED LOCATION,...,BROOKLYN,11226.0,40.656183,-73.951583,9.0,40.0,802.0,3378201.0,3.050500e+09,Prospect Lefferts Gardens-Wingate ...
4,2015-16,K002,75K141,P.S. K141,K141,655 PARKSIDE AVENUE,K,17.0,374,655 PARKSIDE AVENUE CONSOLIDATED LOCATION,...,BROOKLYN,11226.0,40.656183,-73.951583,9.0,40.0,802.0,3378201.0,3.050500e+09,Prospect Lefferts Gardens-Wingate ...

In [12]:
#see all the columns
safety_db.columns

Index(['School Year', 'Building Code', 'DBN', 'Location Name', 'Location Code',
       'Address', 'Borough', 'Geographical District Code', 'Register',
       'Building Name', '# Schools', 'Schools in Building', 'Major N', 'Oth N',
       'NoCrim N', 'Prop N', 'Vio N', 'ENGroupA', 'RangeA', 'AvgOfMajor N',
       'AvgOfOth N', 'AvgOfNoCrim N', 'AvgOfProp N', 'AvgOfVio N',
       'Borough Name', 'Postcode', 'Latitude', 'Longitude', 'Community Board',
       'Council District ', 'Census Tract', 'BIN', 'BBL', 'NTA'],
      dtype='object')

In [13]:
#drop unneeded columns
safety_db.rename(columns={'DBN': 'school_id'}, inplace = True)
safety_db = safety_db[['school_id', 'Major N', 'Oth N',
       'NoCrim N', 'Prop N', 'Vio N']]
safety_db.head()

  school_id  Major N  Oth N  NoCrim N  Prop N  Vio N
0    17K006      0.0    1.0       2.0     1.0    0.0
1    16K005      0.0    0.0       2.0     0.0    0.0
2    13K003      0.0    0.0       2.0     0.0    0.0
3       NaN      0.0    3.0       1.0     0.0    1.0
4    75K141      NaN    NaN       NaN     NaN    NaN

In [14]:
#adds a total crime column
safety_db['total_crime'] = safety_db['Major N']+ safety_db['Oth N']+safety_db['NoCrim N']+safety_db['Prop N']+safety_db['Vio N']
safety_db.head()

  school_id  Major N  Oth N  NoCrim N  Prop N  Vio N  total_crime
0    17K006      0.0    1.0       2.0     1.0    0.0          4.0
1    16K005      0.0    0.0       2.0     0.0    0.0          2.0
2    13K003      0.0    0.0       2.0     0.0    0.0          2.0
3       NaN      0.0    3.0       1.0     0.0    1.0          5.0
4    75K141      NaN    NaN       NaN     NaN    NaN          NaN

In [15]:
#drop rows with no reported crimes 
safety_db.dropna(inplace=True)
safety_db.drop_duplicates('school_id',inplace=True)
safety_db.shape

(892, 7)

-----------------------------SAT Scores DB -----------------------------------------------------------

In [16]:
#open SAT DB
csv_file = "Resources/scores.csv"
df = pd.read_csv(csv_file)
df.head()

,School ID,School Name,Borough,Building Code,Street Address,City,State,Zip Code,Latitude,Longitude,...,End Time,Student Enrollment,Percent White,Percent Black,Percent Hispanic,Percent Asian,Average Score (SAT Math),Average Score (SAT Reading),Average Score (SAT Writing),Percent Tested
0,02M260,Clinton School Writers and Artists,Manhattan,M933,425 West 33rd Street,Manhattan,NY,10001,40.75321,-73.99786,...,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN,NaN
1,06M211,Inwood Early College for Health and Informatio...,Manhattan,M052,650 Academy Street,Manhattan,NY,10002,40.86605,-73.92486,...,3:00 PM,87.0,3.4%,21.8%,67.8%,4.6%,NaN,NaN,NaN,NaN
2,01M539,"New Explorations into Science, Technology and ...",Manhattan,M022,111 Columbia Street,Manhattan,NY,10002,40.71873,-73.97943,...,4:00 PM,1735.0,28.6%,13.3%,18.0%,38.5%,657.0,601.0,601.0,91.0%
3,02M294,Essex Street Academy,Manhattan,M445,350 Grand Street,Manhattan,NY,10002,40.71687,-73.98953,...,2:45 PM,358.0,11.7%,38.5%,41.3%,5.9%,395.0,411.0,387.0,78.9%
4,02M308,Lower Manhattan Arts Academy,Manhattan,M445,350 Grand Street,Manhattan,NY,10002,40.71687,-73.98953,...,3:00 PM,383.0,3.1%,28.2%,56.9%,8.6%,418.0,428.0,415.0,65.1%

In [17]:
SAT = df.drop(columns=['Start Time', 'End Time', 'Borough', 'Building Code', 'Street Address', 'City', 'State', 'Zip Code', 'Latitude', 
                  'Longitude', 'Phone Number','Start Time','End Time', 'Student Enrollment', 'Percent White', 'Percent Black', 
                   'Percent Hispanic', 'Percent Asian'])
SAT = SAT.rename(columns={'School ID':'school_id','Average Score (SAT Math)': 'Avg Score Math', 'Average Score (SAT Reading)': 'Avg Score Reading',
                         'Average Score (SAT Writing)': 'Avg Score Writing', 'Percent Tested': '% Tested'})
SAT = SAT.dropna()
SAT = SAT.drop_duplicates(keep='last')
SAT.head()

,school_id,School Name,Avg Score Math,Avg Score Reading,Avg Score Writing,% Tested
2,01M539,"New Explorations into Science, Technology and ...",657.0,601.0,601.0,91.0%
3,02M294,Essex Street Academy,395.0,411.0,387.0,78.9%
4,02M308,Lower Manhattan Arts Academy,418.0,428.0,415.0,65.1%
5,02M545,High School for Dual Language and Asian Studies,613.0,453.0,463.0,95.9%
6,01M292,Henry Street School for International Studies,410.0,406.0,381.0,59.7%

-----------------------------Whole Team - Conforming All The DBs------------------------------

In [24]:
#set school id as index
safety_db.set_index('school_id',inplace=True)
safety_db.rename(columns={'Oth N':'Orth N'},inplace=True)
safety_db.head()

           Major N  Orth N  NoCrim N  Prop N  Vio N  total_crime
school_id
17K006         0.0     1.0       2.0     1.0    0.0          4.0
16K005         0.0     0.0       2.0     0.0    0.0          2.0
13K003         0.0     0.0       2.0     0.0    0.0          2.0
15K001         0.0     1.0       0.0     1.0    0.0          2.0
13K008         3.0     0.0       0.0     3.0    0.0          6.0

In [31]:
#set school id as index
SAT.set_index('school_id',inplace=True)
SAT.head()

,School Name,Avg Score Math,Avg Score Reading,Avg Score Writing,% Tested
school_id,,,,,
01M539,"New Explorations into Science, Technology and ...",657.0,601.0,601.0,91.0%
02M294,Essex Street Academy,395.0,411.0,387.0,78.9%
02M308,Lower Manhattan Arts Academy,418.0,428.0,415.0,65.1%
02M545,High School for Dual Language and Asian Studies,613.0,453.0,463.0,95.9%
01M292,Henry Street School for International Studies,410.0,406.0,381.0,59.7%

-----------------------------Output SQLs ----------------------------------------------------------

In [36]:
#create engine
engine = create_engine(f'postgresql://postgres:ENTER-PASSWORD-HERE!@localhost:5432/project_2')
conn = engine.connect()

In [1]:
#append SQL database
school_attendance_df.to_sql(name='school_attendance', con=conn, if_exists='append', index=True)

In [38]:
#check to make sure appended
pd.read_sql('select * from school_attendance',conn)

,school id,enrolled_2015_2018,present_2015_2018,absent_2015_2018,attendance_prc
0,01M015,176,165,12,93.37
1,01M019,267,243,24,90.96
2,01M020,535,498,37,93.01
3,01M034,359,326,33,90.76
4,01M063,202,187,15,92.69
...,...,...,...,...,...
1644,75X754,484,279,190,57.64
1645,75X811,633,524,102,82.83
1646,79M331,11,6,5,53.49
1647,79Q344,423,199,202,46.90
1648,79X695,245,190,44,77.36

In [160]:
#appended SQL database
safety_db.to_sql(name='safety', con=conn, if_exists='append', index=True)

In [39]:
#check to make sure appended
pd.read_sql('select * from schools',conn)

,school id,school_name,borough,total_students
0,27Q260,Frederick Douglass Academy VI High School,Queens,412.0
1,21K559,Life Academy High School for Film and Music,Brooklyn,260.0
2,16K393,Frederick Douglass Academy IV Secondary School,Brooklyn,155.0
3,08X305,Pablo Neruda Academy,Bronx,335.0
4,03M485,Fiorello H. LaGuardia High School of Music & A...,Manhattan,2730.0
...,...,...,...,...
430,02M300,Urban Assembly School of Design and Constructi...,Manhattan,427.0
431,09X412,Bronx High School of Business,Bronx,359.0
432,32K549,Bushwick School for Social Justice,Brooklyn,416.0
433,02M407,Institute for Collaborative Education,Manhattan,468.0
434,21K344,Rachel Carson High School for Coastal Studies,Brooklyn,517.0

In [187]:
#Append SQL database
directory_db.to_sql(name='schools', con=conn, if_exists='append', index=True)

In [188]:
#check to make sure appended
pd.read_sql('select * from schools',conn)

,school id,school_name,borough,total_students
0,27Q260,Frederick Douglass Academy VI High School,Queens,412.0
1,21K559,Life Academy High School for Film and Music,Brooklyn,260.0
2,16K393,Frederick Douglass Academy IV Secondary School,Brooklyn,155.0
3,08X305,Pablo Neruda Academy,Bronx,335.0
4,03M485,Fiorello H. LaGuardia High School of Music & A...,Manhattan,2730.0
...,...,...,...,...
430,02M300,Urban Assembly School of Design and Constructi...,Manhattan,427.0
431,09X412,Bronx High School of Business,Bronx,359.0
432,32K549,Bushwick School for Social Justice,Brooklyn,416.0
433,02M407,Institute for Collaborative Education,Manhattan,468.0
434,21K344,Rachel Carson High School for Coastal Studies,Brooklyn,517.0